import React from 'react'

const Skill = () => {
    return (
        <section id="skill">
            <div className="skill__inner">
                <h2 className="skill__title">
                    GROWTH<em>나의 성장</em>
                </h2>
                <div className="skill__desc">
                    <div>
                        <span>1.</span>
                        <h3>연출, 재현 그리고 개발</h3>
                        <p>
                            줄곧 상상을 실현하는 것에 꿈을 가져왔습니다.
                            때문에 영상 연출, 시나리오 제작에 열정을 쏟았습니다.
                            하지만 당장 즉각적인 재현을 원하던 저에게는 다소 부족함이 있었습니다.
                            당장 내가 만들고자 하는 걸 효과적으로 나타낼 수 있는 게 무엇일까?
                            그 물음들의 끝에는 '개발'이라는 단어가 저를 기다리고 있었습니다.
                        </p>
                    </div>
                    <div>
                        <span>2.</span>
                        <h3>남들보다 한 시간 빨리 할 수 있는 능력</h3>
                        <p>
                            줄곧 상상을 실현하는 것에 꿈을 가져왔습니다.
                            때문에 영상 연출, 시나리오 제작에 열정을 쏟았습니다.
                            하지만 당장 즉각적인 재현을 원하던 저에게는 다소 부족함이 있었습니다.
                            당장 내가 만들고자 하는 걸 효과적으로 나타낼 수 있는 게 무엇일까?
                            그 물음들의 끝에는 '개발'이라는 단어가 저를 기다리고 있었습니다.
                        </p>
                    </div>
                    <div>
                        <span>3.</span>
                        <h3>다른 사람이 걷지 않는 길을 가다.</h3>
                        <p>
                            줄곧 상상을 실현하는 것에 꿈을 가져왔습니다.
                            때문에 영상 연출, 시나리오 제작에 열정을 쏟았습니다.
                            하지만 당장 즉각적인 재현을 원하던 저에게는 다소 부족함이 있었습니다.
                            당장 내가 만들고자 하는 걸 효과적으로 나타낼 수 있는 게 무엇일까?
                            그 물음들의 끝에는 '개발'이라는 단어가 저를 기다리고 있었습니다.
                        </p>
                    </div>
                </div>
            </div>
        </section>
    )
}

export default Skill